--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\homewor
> k2_2.log
  log type:  text
 opened on:  12 Apr 2019, 09:23:47

. cd "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2"
\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2

. *question 3

. use "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\AED_PRICEEARN
> INGS.DTA"
(Data for A. Colin Cameron (2015): Analysis of Economics Data, W.W. Norton)

. generate pelag = pe[_n-1]
(1 missing value generated)

. list in 1/5

     +----------------------------------------------------------+
     |    date   gs10_i~e   pe_ratio   inflation   year   pelag |
     |----------------------------------------------------------|
  1. | 1881.12   3.626667      15.96    6.999728   1881       . |
  2. | 1882.12   3.629167      15.38    -1.86875   1882   15.96 |
  3. | 1883.12   3.620833       14.9   -7.619781   1883   15.38 |
  4. | 1884.12   3.528333      13.43   -10.30882   1884    14.9 |
  5. | 1885.12     3.3825       16.3   -1.149661   1885   13.43 |
     +----------------------------------------------------------+

. generate annperchratiope = (pe-pelag)/pelag
pe ambiguous abbreviation
r(111);

. generate annperchratiope = (pe_ratio-pelag)/pelag
(1 missing value generated)

. tsline annperchratiope

. tsline pe_ratio

. tsline annperchratiope

. *we can see the change rate more precisely compared to the original one, where
>  the change rate of data in the past tends to be minified because the absolut 
> values are smaller.

. tsset year
        time variable:  year, 1881 to 2012
                delta:  1 unit

. generate pepercentagechange = 100*d.pe/l.pe
pe ambiguous abbreviation
r(111);

. generate pepercentagechange = 100*d.pe_ratio/l.pe_ratio
(1 missing value generated)

. tsline pepercentagechange

. *it's the same.

. *question 4

. clear

. *question 5

. view "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\MUSIC.TXT"

. view "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\MUSIC.TXT"

. view "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\MUSIC.TXT"

. use "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\MUSIC.TXT"
file \\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\MUSIC.TXT not
    Stata format
r(610);

. import delimited "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\
> MUSIC.TXT"
(2 vars, 3 obs)

. graph pie number

. graph pie music, over(number)
string variables not allowed in varlist;
music is a string variable
r(109);

. graph pie number, over(music)

. graph pie number, over(number)

. graph pie number, over(music) plabel(_all name) title(Music Downloads)

. *it looks around 50% of  the sample use the Internet and pay to download

. music.
music. is not a valid command name
r(199);

. *it looks around 50% of  the sample use the Internet and pay to download music
> .

. graph pie number if music = Internet - No Pay or music = Internet - Paid, over
> (music) plabel(_all name) title(Music Downloads (Internet Only))
type mismatch
r(109);

. graph pie number if music = Internet - No Pay, Internet - Paid, over(music) pl
> abel(_all name) title(Music Downloads (Internet Only))
type mismatch
r(109);

. graph pie number if music == "Internet - No Pay" | music == "Internet - Paid",
>  over(music) plabel(_all name) title(Music Downloads (Internet Only))

. *among internet downloaders, around 1/3 didn't pay.

. clear

. *question 6

. import delimited "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\
> TOP175.TXT", clear
(9 vars, 175 obs)

. hist industry
string variables not allowed in varlist;
industry is a string variable
r(109);

. tabulate industry

            Industry |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Aerospace & Defense |          7        4.00        4.00
             Banking |          3        1.71        5.71
 Business Services & |          2        1.14        6.86
       Capital Goods |          6        3.43       10.29
           Chemicals |          6        3.43       13.71
       Conglomerates |          7        4.00       17.71
        Construction |          2        1.14       18.86
   Consumer Durables |          3        1.71       20.57
Diversified Financia |          9        5.14       25.71
Drugs & biotechnolog |         12        6.86       32.57
Food Drink & tobacco |          8        4.57       37.14
Health care equipmen |         12        6.86       44.00
 Hotels, Restaurants |          5        2.86       46.86
Household & personal |          7        4.00       50.86
           Insurance |          7        4.00       54.86
           Materials |          4        2.29       57.14
               Media |          9        5.14       62.29
Oil & Gas Operations |         14        8.00       70.29
           Retailing |         14        8.00       78.29
      Semiconductors |          6        3.43       81.71
 Software & Services |          5        2.86       84.57
 Technology Hardware |          9        5.14       89.71
Telecommunications s |          4        2.29       92.00
      Transportation |          6        3.43       95.43
           Utilities |          8        4.57      100.00
---------------------+-----------------------------------
               Total |        175      100.00

. hist industry frequency
variable frequency not found
r(111);

. hist industry, frequency
string variables not allowed in varlist;
industry is a string variable
r(109);

. graph bar industry, frequency
type mismatch
r(109);

. graph bar industry
type mismatch
r(109);

. graph bar industry, over(industry) frequency
industry may not be both target and by()
r(198);

. graph bar count(industry)
industry:  may not use time-series operators on string variables
r(109);

. graph bar percent(industry)
industry:  may not use time-series operators on string variables
r(109);

. graph hbar (count), over(industry) scale (.75)

. *question 7

. clear

. import delimited "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\
> MMC.TXT", clear
(2 vars, 5 obs)

. graph pie performancemeasure, over number
string variables not allowed in varlist;
performancemeasure is a string variable
r(109);

. graph pie number, over performancemeasure
option over not allowed
r(198);

. graph pie number

. graph pie number, over (performancemeasure)

. graph pie number, over (performancemeasure) plabel(_all name)

. graph pie number, over (performancemeasure) plabel(_all name)

. graph export "\\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\Grap
> h q7.png", as(png) replace
(note: file \\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\Graph q7
> .png not found)
(file \\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\Graph q7.png w
> ritten in PNG format)

. log close
      name:  <unnamed>
       log:  \\apporto.com\dfs\UCI\Users\kims11_uci\Downloads\Homework 2\homewor
> k2_2.log
  log type:  text
 closed on:  12 Apr 2019, 10:23:18
--------------------------------------------------------------------------------
